# GetLinePatternElementByName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternElement..::..GetLinePatternElementByName Method
LinePatternElement Class See Also
---
Retrieves the LinePatternElement by its name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static LinePatternElement GetLinePatternElementByName(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function GetLinePatternElementByName ( _
	document As Document, _
	name As String _
) As LinePatternElement
```

Visual C++
---
```text
public:
static LinePatternElement^ GetLinePatternElementByName(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document in which to retrieve the LinePatternElement.
name
    Type: System..::..String The name of the LinePatternElement.
# ### Return Value
The LinePatternElement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LinePatternElement Class
Autodesk.Revit.DB Namespace